# Задача №1 (практикум №1, основной блок)
print('Hello, world!')
print('Маша + Петя = Любовь')
z = 3+4
print(z)
# Задача №2 (практикум №1, основной блок)

# х = ‘Hello, World!’ - переменная текст
# х = 3 + 4 - переменна мат. выражени умножение 
# х = 3 / 4 - переменна мат. выражени деление
# х = [1, 2, 5, 10, 100] - переменная список

# Задача №3 (практикум №1, основной блок)
import math
x = 3 
y = (((math.sqrt(math.pow(3, 3))/(math.pow(3, 3) + 3/x)) * (4*(math.pow(3, 7) - (math.pow(3, 5))))) + 80 * (math.sqrt(27 * (math.pow(3, 4))+ 12*(math.pow(3, 3))- 5* (math.pow(3, 2))+ 10)))
o = ((math.fmod(3, 2))+ math.ceil(16.7 * 4.32)) / 14.5 + (math.fmod(31, 12)) - (math.ceil(math.pow(x, 3.4)))
print (y)
print (o)

#Задача №4 (практикум №1, основной блок)
a = [1, 5, "Good", "Bad"]
b = [9, "Blue", "Red", 11]
print( a[1] + b[3])
print( a[2] + b[2])
print( a[0] * b[0])
print( math.pow(a[1],  b[3]))
print( a + b)
